resources/templates/soap/metadata/CreateRemoteSite.xml.handlebars

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <env:Header>
        <urn:SessionHeader xmlns:urn="http://soap.sforce.com/2006/04/metadata">
            <urn:sessionId>{{authToken}}</urn:sessionId>
        </urn:SessionHeader>
    </env:Header>
    <env:Body>
        <createMetadata xmlns="http://soap.sforce.com/2006/04/metadata">
            <metadata xsi:type="RemoteSiteSetting">
                <fullName>{{name}}</fullName>
                <isActive>true</isActive>
                <url>{{endpointUrl}}</url>
            </metadata>
        </createMetadata>
    </env:Body>
</env:Envelope>
